In [1]:
import pandas as pd

In [9]:
df = pd.read_excel("E:\DATA SETS\earthquake_mini.xlsx", index_col=0)
df

               DateTime  Magnitude  Depth  Latitude  Longitude Source
0      01/01/1973 11:42          6     33    -35513     -16211     US
1      01/02/1973 00:53         55     66     -9854     117427     US
2      01/03/1973 02:58         56    563    -27716     -63261     US
3      01/03/1973 14:31         55     33     39114      71889     US
4      01/05/1973 13:54         62    150    -38997     175232     US
...                 ...        ...    ...       ...        ...    ...
20625  12/25/2016 14:32         56   1493    -43481    -744771     US
20626  12/27/2016 23:20         56     97    457192      26523     US
20627  12/28/2016 12:38         59     10    369179    1404262     US
20628  12/29/2016 22:30         63     79    -90283    1186639     US
20629  12/30/2016 20:08         55   1194    373973    1414103     US

[20630 rows x 6 columns]

In [10]:
df.info() #notice that dateTime columns is an object

<class 'pandas.core.frame.DataFrame'>
Index: 20630 entries, 0 to 20629
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   DateTime   20627 non-null  object
 1   Magnitude  20630 non-null  int64
 2   Depth      20630 non-null  int64
 3   Latitude   20630 non-null  int64
 4   Longitude  20630 non-null  int64
 5   Source     20630 non-null  object
dtypes: int64(4), object(2)
memory usage: 1.1+ MB

In [11]:
#look at the date
df["DateTime"]

0        01/01/1973 11:42
1        01/02/1973 00:53
2        01/03/1973 02:58
3        01/03/1973 14:31
4        01/05/1973 13:54
               ...
20625    12/25/2016 14:32
20626    12/27/2016 23:20
20627    12/28/2016 12:38
20628    12/29/2016 22:30
20629    12/30/2016 20:08
Name: DateTime, Length: 20630, dtype: object

In [15]:
# Convert the "DateTime" column to a Pandas date and time object with the desired format.
df['DateTime'] = pd.to_datetime(df['DateTime'], format='%m/%d/%Y %H:%M')

# Verify that the conversion was successful
print(df.dtypes)

DateTime     datetime64[ns]
Magnitude             int64
Depth                 int64
Latitude              int64
Longitude             int64
Source               object
dtype: object

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 20630 entries, 0 to 20629
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   DateTime   20627 non-null  datetime64[ns]
 1   Magnitude  20630 non-null  int64
 2   Depth      20630 non-null  int64
 3   Latitude   20630 non-null  int64
 4   Longitude  20630 non-null  int64
 5   Source     20630 non-null  object
dtypes: datetime64[ns](1), int64(4), object(1)
memory usage: 1.1+ MB

In [24]:
#dt.day_name properties
df['DayName'] = df['DateTime'].dt.day_name()

In [25]:
print(df.head())

             DateTime  Magnitude  Depth  Latitude  Longitude Source    DayName
0 1973-01-01 11:42:00          6     33    -35513     -16211     US     Monday
1 1973-01-02 00:53:00         55     66     -9854     117427     US    Tuesday
2 1973-01-03 02:58:00         56    563    -27716     -63261     US  Wednesday
3 1973-01-03 14:31:00         55     33     39114      71889     US  Wednesday
4 1973-01-05 13:54:00         62    150    -38997     175232     US     Friday

In [26]:
#dt.quarter
df["DateTime"].dt.quarter

0        1.0
1        1.0
2        1.0
3        1.0
4        1.0
        ...
20625    4.0
20626    4.0
20627    4.0
20628    4.0
20629    4.0
Name: DateTime, Length: 20630, dtype: float64

In [27]:
#strftime
df["DateTime"].dt.strftime("%d-%B-%Y")

0         01-January-1973
1         02-January-1973
2         03-January-1973
3         03-January-1973
4         05-January-1973
               ...
20625    25-December-2016
20626    27-December-2016
20627    28-December-2016
20628    29-December-2016
20629    30-December-2016
Name: DateTime, Length: 20630, dtype: object